app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "MyString"], ["created_at", "2022-06-09 01:42:03.045180"], ["updated_at", "2022-06-09 01:42:03.045180"]]
---
  def create
    @band = Band.new(band_params)

    if @band.save

DELETE FROM "bands" WHERE "bands"."id" = ?  [["id", 980190962]]
---
  def destroy
    @band.destroy

SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def set_band
    @band = Band.find(params[:id])